# ForegroundAnyPatternIdParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ForegroundAnyPatternIdParam Property
ParameterTypeId Class See Also
---
"Foreground Fill Pattern"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ForegroundAnyPatternIdParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ForegroundAnyPatternIdParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ForegroundAnyPatternIdParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace